'''
# Задача 1.1
# принимает на вход N и выдает послед-ть из N членов

N = int(input('Введите число: '))
numbers = []
for i in range(0, N):
    a = (-3)**i
    numbers.append(a)
print(N, ': ', numbers)
'''

'''
# Задача 1.2
n = int(input('введите число: '))
y = 1
while n:
    print(y)
    y *= -3
    n -= 1
'''

'''
# Задача 2.1
# Для натурального n создать словарь индекс-значений
# состоящий из эл-тов последовательности 3n+1.
# пример. n = 6: 4, 7, 10, 13, 16, 19

N = int(input('Введите число: '))
numbers = []
for i in range(1, N + 1):
    a = 1 + 3*i
    numbers.append(a)
print(N, ': ', numbers)
'''

'''
# Задача 2.2
n = int(input('введите число: '))
y = 4
while n:
    print(y, end=' ')
    y += 3
    n -= 1 
'''

'''
# Задача 3.1
# программа, в которой пользователь будет задавать две строки,
# а программа - определять кол-во вхождений одной строки в другой.

n = str(input('Введите строку: '))
k = str(input('Введите проверочную строку: '))
print(n.count(k))
'''

'''
# Задача 3.2. При помощи среза
n = str(input('Введите строку: '))
k = str(input('Введите проверочную строку: '))
count = 0
for i in range(len(n)):
    if k == n[i:len(k)+i]:
        count += 1
print(count)
'''


