# # Задание 1. Принимает на вход цифру, обозначающую день недели и проверяет, явл. ли день выходным.
# day = int(input('Введите день: '))

# if 1 <= day <= 5:
#     print('Будний день')
# elif 6 <= day <= 7:
#     print('Выходной')
# else:
#     print('такого дня нет')


# # Задание 2. Программу для проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
# x = int(input('Введите х = '))
# y = int(input('Введите y = '))
# z = int(input('Введите z = '))

# expression1 = not(x or y or z)
# expression2 = not x and not y and not z
# if expression1 == expression2:
#     print('t')
# else:
#     print('f')




# # Задание 3. Принимает на вход координаты точки (x, y) и выдает номер четверти плоскости, где точка.
# x = int(input('Введите х = '))
# y = int(input('Введите y = '))

# if x > 0 and y > 0:
#     print('Первая четверть')
# elif x < 0 and y > 0:
#     print('Вторая четверть')
# elif x < 0 and y < 0:
#     print('Третья четверть')
# else:
#     print('Четвертая четверть')


'''
# Задание 4. По заданному номеру четверти, показывает диапозон возможных координат точек в этой четверти (x, y).
quarter = int(input('Введите номер четверти '))
if quarter == 1:
    print('(x > 0, y > 0)')
elif quarter == 2:
    print('(x < 0, y > 0)')
elif quarter == 3:
    print('(x < 0, y < 0)')
else:
    print('x > 0, y < 0')
'''

'''
# Задание 5. Принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве. 
Xa = int(input('Введите х координату точки А = '))
Ya = int(input('Введите y координату точки А = '))
Xb = int(input('Введите х координату точки B = '))
Yb = int(input('Введите y координату точки B = '))

commonx = Xb - Xa
commony = Yb - Ya
lenght = round((commonx**2 + commony**2)**(0.5), 3)    # решил сделать округление до трех знаков. Не знал как вывести , чтобы без округления.
print(lenght)
'''
